{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 600, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "rescaling_2_input"}}, {"class_name": "Rescaling", "config": {"name": "rescaling_2", "trainable": true, "batch_input_shape": [null, 600, 600, 3], "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of44.bin", "group1-shard2of44.bin", "group1-shard3of44.bin", "group1-shard4of44.bin", "group1-shard5of44.bin", "group1-shard6of44.bin", "group1-shard7of44.bin", "group1-shard8of44.bin", "group1-shard9of44.bin", "group1-shard10of44.bin", "group1-shard11of44.bin", "group1-shard12of44.bin", "group1-shard13of44.bin", "group1-shard14of44.bin", "group1-shard15of44.bin", "group1-shard16of44.bin", "group1-shard17of44.bin", "group1-shard18of44.bin", "group1-shard19of44.bin", "group1-shard20of44.bin", "group1-shard21of44.bin", "group1-shard22of44.bin", "group1-shard23of44.bin", "group1-shard24of44.bin", "group1-shard25of44.bin", "group1-shard26of44.bin", "group1-shard27of44.bin", "group1-shard28of44.bin", "group1-shard29of44.bin", "group1-shard30of44.bin", "group1-shard31of44.bin", "group1-shard32of44.bin", "group1-shard33of44.bin", "group1-shard34of44.bin", "group1-shard35of44.bin", "group1-shard36of44.bin", "group1-shard37of44.bin", "group1-shard38of44.bin", "group1-shard39of44.bin", "group1-shard40of44.bin", "group1-shard41of44.bin", "group1-shard42of44.bin", "group1-shard43of44.bin", "group1-shard44of44.bin"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [360000, 128], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [128, 5], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [5], "dtype": "float32"}]}]}